app/controllers/api/coreg_optins_controller.rb

  def list
    @page = Page.find_by_name(referer)
    #coregs_available = Coreg.where(:screen_key => referer)
    if referer != "dfm_hotdeals"
      coregs_available = @page.coregs
    else
      coregs_available = @page.adjusted_coregs
    end
    coregs_taken = CoregOptin.find_all_by_hashcode(request_serial).collect{|x| x.coreg }
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`name` = 'dfm_home' LIMIT 1
SELECT `coreg_optins`.* FROM `coreg_optins` WHERE `coreg_optins`.`hashcode` = 'ece65d74-82df-4310-bec9-44a275a2d4f2'