app/controllers/members_controller.rb

  def edit
    @title = 'Edit Account'
    @js_key =  js_key('step2')
    deny_access and return unless signed_in_dfm?
    @member = Member.find(session[:member_id])
---
SELECT `members`.* FROM `members` WHERE `members`.`id` = 12 LIMIT 1

  def create
    @title   = 'Find Deals, Coupons, & Samples Online From Top Brands at Deals For Mommy'
    @member = Member.new(params[:member])
    @member.ip_address = request.remote_ip
		@promo = ''
    @js_key =  js_key('new')
    if ! session[:aff_utm].nil?
      aff_utm = session[:aff_utm]
      @member.affiliate_id  = aff_utm[0] # as per the HO pixel utm_content is affiliate id
      @member.affiliate_sub_id = aff_utm[1] # as per the HO pixel utm_term is affiliate_sub_id
    end
    @member.entrypath = session[:form] || ''
   # set for long form
   if( session[:form] != 'partial_member')
      @member.check_dob
      @member.updating_password = true
      @member.password              = params[:member][:password]
      @member.password_confirmation = params[:member][:password]
      @member.postal_code = params[:member][:address_attributes][:postal]
      unless @member.valid?
        @message = @member.errors[:password]
      end
   end

   # downcase the email to avoid duplication
   @member.email.downcase!

   #save member details
    if @member.save
---
INSERT INTO `members` (`first_name`, `last_name`, `email`, `password`, `created_at`, `updated_at`, `postal_code`, `salt`, `ip_address`, `gender`, `partner_id`, `dob`, `original_email`, `affiliate_id`, `affiliate_sub_id`, `entrypath`) VALUES ('alexander', 'urov', 'alur@mvs.net.ua', NULL, '2013-06-24 20:16:48', '2013-06-24 20:16:48', '11563', NULL, '127.0.0.1', 'F', 0, NULL, 'alur@mvs.net.ua', NULL, NULL, 'partial_member')

  def recover_password
		@title = 'Recover Password'
		@meta_description = 'In case of lost password, enter your email and we will email the password in a moment.'
		@meta_keywords = 'deals for mommy, mommy deals, daily deals for mom, deals for moms, coupon moms, coupons for mom, free diapers'
    if request.post?
      if params[:email] =~ /^([^@\s]+)@((?:[-a-z0-9]+\.)+[a-z]{2,})$/i
				@member = Member.where(:email => params[:email]).first #.where("password IS NOT ?", nil).first
---
SELECT `members`.* FROM `members` WHERE `members`.`email` = 'alur@mvs.net.ua' LIMIT 1