app/controllers/sessions_controller.rb

  def create
    member = Member.authenticate(params[:session][:email],params[:session][:password])
		@title = TITLE
		@meta_keywords = META_DESCRIPTION
		@meta_description = META_KEYWORDS
    if member.blank?
---
SELECT `members`.* FROM `members` WHERE `members`.`email` = 'alur@mvs.net.ua' LIMIT 1