app/views/members/_form.html.erb

SELECT `states`.* FROM `states`
---
            <div style="width:70px">
              <%= address_form.input :state, :label => 'State', :collection => State.all.map { |state| state.code }, :input_html =>{ :style =>'clear: left' }, :include_blank => 'Select' %>

SELECT `addresses`.* FROM `addresses` WHERE (`addresses`.member_id = 12) LIMIT 1
---

        <%if (@member.address.country == "US")%>